# customer-shared - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.database.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.kafka_topic.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.kafka_topic.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=staging-kafka-cluster-id]
module.common_resources.module.database.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=staging-cockroachdb-serverless-cluster-id]
module.common_resources.module.kafka_topic.upstash_kafka_topic.default: Refreshing state... [id=upstash-kafka-topic-e8a5e2a6-385a-4223-a811-d32e01b59d2b]
module.common_resources.module.database.cockroach_database.default: Refreshing state... [id=7f49bf76-cc5f-4933-b3bc-be5dc402a617:staging-customer]
module.common_resources.module.database_migration_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.database_migration_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.database_migration_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=staging-cockroachdb-serverless-cluster-id]
module.common_resources.module.database_migration_user.cockroach_sql_user.default: Refreshing state... [id=7f49bf76-cc5f-4933-b3bc-be5dc402a617:staging-customer-database-migration]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.database_migration_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "staging-customer"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "staging-customer-database-migration"
    }

  # module.common_resources.module.database_migration_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "7f49bf76-cc5f-4933-b3bc-be5dc402a617:staging-customer-database-migration"
        name       = "staging-customer-database-migration"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_migration_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "3002968c-adff-4551-86cf-b182570b2262" -> "e9183645-8d00-497c-90bd-d07f2af357bf"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

  # module.common_resources.module.kafka_topic.upstash_kafka_topic.default will be updated in-place
  ~ resource "upstash_kafka_topic" "default" {
        id               = "upstash-kafka-topic-e8a5e2a6-385a-4223-a811-d32e01b59d2b"
      ~ max_message_size = 829213 -> 1048576
      ~ retention_size   = 725124 -> 268435456
      ~ retention_time   = 625135 -> 259200000
        # (13 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ database_migration_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*